documentation/tspe/tspe_1.1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-19 qua 23:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Terminal Supaplex Editor Official Documentation (Work in Progress)</title>
<meta name="author" content="Matthew (MF366)" />
<meta name="description" content="The official documentation for TSpE - Terminal Supaplex Editor." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Terminal Supaplex Editor Official Documentation (Work in Progress)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd3a6a0f">1. About the Documentation</a>
<ul>
<li><a href="#org4ee6688">1.1. Licensing (Docs)</a></li>
<li><a href="#org39fde3c">1.2. Contributing</a></li>
</ul>
</li>
<li><a href="#org58f0a8d">2. What is TSpE?</a>
<ul>
<li><a href="#org3977d22">2.1. Licensing (TSpE)</a></li>
</ul>
</li>
<li><a href="#org1909711">3. How to install TSpE</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd3a6a0f" class="outline-2">
<h2 id="orgd3a6a0f"><span class="section-number-2">1.</span> About the Documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
The page/document you are currently looking at is the <b>Official Documentation for Terminal Supaplex Editor a.k.a. TSpE</b>. It, along with the software itself, is made primarily by Matthew (<a href="https://mf366-coding.github.io">MF366</a>) using <code>Org Mode</code> on <code>Emacs</code>, later exported to <code>HTML</code>.
</p>
</div>
<div id="outline-container-org4ee6688" class="outline-3">
<h3 id="org4ee6688"><span class="section-number-3">1.1.</span> Licensing (Docs)</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
This section is about the LICENSE of this document. For TSpE&rsquo;s LICENSE, see section 2.1: <a href="#org3977d22">Licensing (TSpE)</a>.
</p>
</blockquote>

<p>
This documentation is licensed under the <b>GNU Free Documentation License (GFDL)</b>. Therefore, all edits, reuses and whatnot of this documentation (valid for both <code>Org</code> and <code>HTML</code> versions of the docs) must comply with GFDL&rsquo;s terms and conditions.
</p>
</div>
</div>
<div id="outline-container-org39fde3c" class="outline-3">
<h3 id="org39fde3c"><span class="section-number-3">1.2.</span> Contributing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
If you wish to contribute to the documentation, I&rsquo;d really appreciate it. However, there are some rules and guidelines you must follow:
</p>
<ul class="org-ul">
<li>TODO</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org58f0a8d" class="outline-2">
<h2 id="org58f0a8d"><span class="section-number-2">2.</span> What is TSpE?</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
For its entirety, this documentation assumes the user knows: what Supaplex is and how to, later on, &ldquo;use&rdquo; the levels in software such as Megaplex, or just Supaplex Online. It&rsquo;s highly recommended to have a certain degree of experience around the terminal.
</p>
</blockquote>

<p>
Terminal Supaplex Editor - or <b>TSpE</b> for short - is one of the most recent Supaplex level editors to have the <b>terminal</b> as the main <i>&ldquo;target&rdquo;</i>.
</p>

<p>
Fully made in Python, it is capable of handling basic Supaplex level format (no Megaplex support yet) and is bundled with tons of useful features, one of which is the ability to test the level that&rsquo;s being edited with <b>Supaplex Online</b>, the main platform for uploading levels and playing other people&rsquo;s ones.
</p>

<p>
While it&rsquo;s sadly not very extensible, its easy-to-understand <code>settings.json</code>, the main file you&rsquo;ll be using - as a user - to enhance your experience.
</p>

<p>
Without further ado, let&rsquo;s jump into the second topic: <b>How to install TSpE</b>.
</p>
</div>
<div id="outline-container-org3977d22" class="outline-3">
<h3 id="org3977d22"><span class="section-number-3">2.1.</span> Licensing (TSpE)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
TODO
</p>
</div>
</div>
</div>
<div id="outline-container-org1909711" class="outline-2">
<h2 id="org1909711"><span class="section-number-2">3.</span> How to install TSpE</h2>
<div class="outline-text-2" id="text-3">
<p>
Lorem ipsum etc etc&#x2026;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew (MF366)</p>
<p class="date">Created: 2025-03-19 qua 23:57</p>
</div>
</body>
</html>
